// Імпортуємо необхідні модулі та компоненти для роботи React
import React from 'react';  // Бібліотека React, необхідна для створення компонентів
import ReactDOM from 'react-dom/client';  // Модуль ReactDOM для рендерингу компонента у браузері
import './index.css';  // Імпортуємо глобальні стилі для нашого додатка (файл стилів index.css)
import App from './App';  // Імпортуємо головний компонент додатка — App
import reportWebVitals from './reportWebVitals';  // Імпортуємо функцію для моніторингу продуктивності

// Створюємо корінь для нашого додатка (елемент, в який буде вставлений React додаток)
const root = ReactDOM.createRoot(document.getElementById('root'));

// Рендеримо наш додаток у корінь HTML документа
root.render(
  <React.StrictMode>  {/* StrictMode — режим для виявлення потенційних проблем у додатку під час розробки */}
    <App />  {/* Головний компонент додатка */}
  </React.StrictMode>
);

// Функція для вимірювання продуктивності нашого додатка (наприклад, завантаження сторінки)
reportWebVitals();  // Запускаємо вимірювання продуктивності (за замовчуванням це не виводить результат)
